# Core utilities
brew "git"
brew "gnu-tar"
brew "gzip"
brew "bzip2"
brew "unzip"
brew "p7zip"
brew "make"
brew "gcc"
cask "ghostty"
cask "spotify"
cask "sourcetree"
cask "whatsapp"
cask "obsidian"
cask "visual-studio-code"

# Shell enhancements
brew "starship"
brew "direnv" 
brew "zoxide"
brew "fzf"

# Search and file tools
brew "ripgrep"
brew "fd"
brew "bat"

# Development
brew "n"           # Node version manager
brew "helix"
brew "zellij"

# Git and Docker tools
brew "lazygit"
brew "lazydocker"

# Media tools
brew "ffmpeg"      # For compress_screencaps.sh

# Fonts
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"