# Core utilities
brew "git"
brew "gnu-tar"
brew "gzip"
brew "bzip2"
brew "unzip"
brew "the-unarchiver"
brew "p7zip"
brew "make"
brew "gcc"
brew "xclip"
brew "ghostty"

# Shell enhancements
brew "starship"
brew "direnv" 
brew "zoxide"
brew "fzf"

# Search and file tools
brew "ripgrep"
brew "fd"
brew "bat"

# Development
brew "n"           # Node version manager
brew "neovim"
brew "lua"
brew "luarocks"

# Git and Docker tools
brew "lazygit"
brew "lazydocker"

# Media tools
brew "ffmpeg"      # For compress_screencaps.sh

# Taps
tap "homebrew/cask-fonts"

# Fonts
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"